# Documentation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Field..::..Documentation Property
Field Class See Also
---
The overall description of the Field.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string Documentation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Documentation As String
	Get
```

Visual C++
---
```text
public:
property String^ Documentation {
	String^ get ();
}
```

# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace